tap "astronomer/tap"
tap "dbt-labs/dbt"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "nathan-v/aws-okta-keyman"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Docker Machine driver for xhyve
brew "docker-machine-driver-xhyve"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Manage your Java environment
brew "jenv"
# Little helper to run Rancher Lab's k3s in Docker
brew "k3d"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# LastPass command-line interface tool
brew "lastpass-cli"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@8"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Make Python build faster, using the leverage of `ccache`
brew "pyenv-ccache"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Vi 'workalike' with many additional features
brew "vim"
# Lightweight macOS virtualization solution based on FreeBSD's bhyve
brew "xhyve"
# UNIX shell (command interpreter)
brew "zsh"
# To build and run Airflow DAGs locally via docker-compose and deploy DAGs to Astronomer-managed Airflow clusters and interact with the Astronomer API.
brew "astronomer/tap/astro"
# Data build tool
brew "dbt-labs/dbt/dbt"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Pulls AWS API keys using an Okta SAML assertion
brew "nathan-v/aws-okta-keyman/aws_okta_keyman"
# Application launcher and productivity software
cask "alfred"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Draw.io is free online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "LastPass", id: 926036361
mas "Snappy", id: 512617038
mas "Todoist", id: 585829637
