tap "dbt-labs/dbt"
tap "eth-p/software"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "pantsbuild/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Implementation of JSON Schema for Python
brew "jsonschema"
# Pager program similar to more
brew "less"
# Key-value storage library with ordered mapping
brew "leveldb"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Platform built on V8 to build network applications
brew "node"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@8"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Python version management
brew "pyenv"
# Make Python build faster, using the leverage of `ccache`
brew "pyenv-ccache"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Simplified and community-driven man pages
brew "tldr"
# Vi 'workalike' with many additional features
brew "vim"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Application launcher and productivity software
cask "alfred"
# Universal database tool and SQL client
cask "dbeaver-community"
# Design, document and deploy databases
cask "dbschema"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Draw.io is free online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Fast, scalable, user-friendly build system for codebases of all sizes
cask "pants"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "LastPass", id: 926036361
mas "Microsoft Remote Desktop", id: 1295203466
mas "Snappy", id: 512617038
mas "Todoist", id: 585829637
